Pandas - useful python package for exploratory data analysis. It uses Dataframes, series for processing the data
+ read_csv is used for reading comma separated data
+ read_json for json type values
+ read_html for html tabular data
+ read_excel  for excel file data

In [1]:
import pandas as pd
import numpy as np

In [2]:
##dataframe - tabular form of data 

dataframe = pd.DataFrame(np.linspace(0,20,9).reshape(3,3),index=['row1','row2','row3'],columns=['col1','col2','col3'])

In [3]:
dataframe.head()

      col1  col2  col3
row1   0.0   2.5   5.0
row2   7.5  10.0  12.5
row3  15.0  17.5  20.0

In [4]:
##to write this data to a file
dataframe.to_csv("testSample.csv")

In [5]:
##dataframe info
dataframe.info()       ##displays size,type of all columns

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, row1 to row3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      float64
 1   col2    3 non-null      float64
 2   col3    3 non-null      float64
dtypes: float64(3)
memory usage: 96.0+ bytes

In [6]:
##summary of dataframe
dataframe.describe()       ##will take into account only the numerical column

        col1   col2   col3
count   3.00   3.00   3.00
mean    7.50  10.00  12.50
std     7.50   7.50   7.50
min     0.00   2.50   5.00
25%     3.75   6.25   8.75
50%     7.50  10.00  12.50
75%    11.25  13.75  16.25
max    15.00  17.50  20.00

Accessing elements of dataframe-
+ using name based - loc['row1']
+ using index based location for cols and rows - iloc[rowindex , colindex]

In [7]:
dataframe.loc['row2']

col1     7.5
col2    10.0
col3    12.5
Name: row2, dtype: float64

In [8]:
dataframe['col1']

row1     0.0
row2     7.5
row3    15.0
Name: col1, dtype: float64

In [9]:
dataframe.loc['row2','col1']

7.5

In [10]:
dataframe.iloc[0:1,1:2]

      col2
row1   2.5

In [11]:
dataframe

      col1  col2  col3
row1   0.0   2.5   5.0
row2   7.5  10.0  12.5
row3  15.0  17.5  20.0

In [12]:
##converting data frames to arrays

data_array = dataframe.values
data_array

array([[ 0. ,  2.5,  5. ],
       [ 7.5, 10. , 12.5],
       [15. , 17.5, 20. ]])

In [13]:
dataframe.value_counts()         ##counting the occurence of values in each column
                                    ## this property is useful for cateogrical columns

col1  col2  col3
15.0  17.5  20.0    1
7.5   10.0  12.5    1
0.0   2.5   5.0     1
dtype: int64

In [14]:
dataframe.isnull().sum()           ##shows which column has null values

col1    0
col2    0
col3    0
dtype: int64

In [15]:
dataframe['col1'].unique()         #displays unique value in column

array([ 0. ,  7.5, 15. ])

In [16]:
dataframe[['col1','col3']]            ##displaying selective columns

      col1  col3
row1   0.0   5.0
row2   7.5  12.5
row3  15.0  20.0

 Exploring different parameters in pd.read_csv
 + sep - used for mentioning separator type used in csv file
 + usecols - will tell pandas to use which columns should be included in dataframe
 + index_col - false means no index specified in file
           0 means this field is chosen to be index of read data
 + escapechar - used in NLP text reading for string type data
 + dtype - will convert the datatype of columns in frame

In [17]:
from io import StringIO
string_data = ('col1,col2,col3\n'
                '1,2,3\n'
                '3,4,5\n')
type(string_data)

str

In [18]:
data = pd.read_csv(StringIO(string_data),usecols=['col2'],dtype=float)

In [19]:
data.head()

   col2
0   2.0
1   4.0

In [20]:
data2 = pd.read_csv(StringIO(string_data), dtype={'col1':int, 'col2':float},index_col=0)

In [21]:
data2 ##col1 is index

      col2  col3
col1
1      2.0     3
3      4.0     5

In [22]:
data2.dtypes ##checking data type of all columns

col2    float64
col3      int64
dtype: object

In [23]:
pd.read_csv(StringIO(string_data), dtype={'col1':int, 'col2':float},index_col=False) ##no index specified

   col1  col2  col3
0     1   2.0     3
1     3   4.0     5

In [24]:
pd.read_csv(StringIO(string_data), dtype={'col1':int, 'col2':float},usecols=['col1','col3'],index_col=0)

      col3
col1
1        3
3        5

Reading JSON data

In [25]:
json_data = '{"name" :"xyz", "age" : 30 ,"role" : "Data Analyst","address":[{"houseno" : 123,"street" : "abc","society" : "foothills"," city" : " umd"}],"country" : "INDIA"}'

In [26]:
data = pd.read_json(json_data)

In [27]:
data.head()

,name,age,role,address,country
0,xyz,30,Data Analyst,"{'houseno': 123, 'street': 'abc', 'society': '...",INDIA

In [28]:
##reading wine data from url using read_csv module
wine_data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)

In [29]:
wine_data

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740
174,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750
175,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835
176,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840
177,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560

In [30]:
wine_data.to_csv("wine_data.csv")

In [31]:
## reading HTML tabular data present in URL
df = pd.read_html("https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/index.html")
df[0]           ##displaying all data extracted from site

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"